//
// Created by ad on 26.03.2020.
//

#ifndef AI_FRESH_01_VALUES_H
#define AI_FRESH_01_VALUES_H 

/*Тип загрузки*/                unsigned char type_load = 0;
/*
 * 0 - Стандартная загрузка
 * 44 - Превышение внешнего вольтажа
 * 45 - Внешний вольтаж слишком низкий
 * */

/*Буфер значения выводного регистра*/           unsigned char req_out[24] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
/*Буферизация значения выводного регистра*/     unsigned char buf_req_out[24] = {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1};

/*Буфер значений входного ADC*/                 float adc_v_in[20] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
/*Буфер состояний матрицы клапанов ADC*/        unsigned char relay_out[20] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
/*Буфер состояний LED-матрицы*/                 int led_stat[20][3]={{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0}};

/*Буфер IP*/                    String local_id;
/*Буфер MAC-адреса*/            String mac_dev;
/*Буфер силы сигнала wifi*/     int wifi_rssi;
/*Буфер имети точки доступа*/   String wifi_name;
/*Буфер пароля к точке доступа*/String wifi_pass;

#endif //AI_FRESH_01_VALUES_H
